---
kind: method
id: M:Autodesk.Revit.UI.Mechanical.DuctFittingAndAccessoryPressureDropUIDataItem.GetDuctFittingAndAccessoryData
source: html/2dad17d2-d70d-6a04-6f03-79834d828e91.htm
---
# Autodesk.Revit.UI.Mechanical.DuctFittingAndAccessoryPressureDropUIDataItem.GetDuctFittingAndAccessoryData Method

Gets the fitting data stored in the UI data item.

## Syntax (C#)
```csharp
public DuctFittingAndAccessoryData GetDuctFittingAndAccessoryData()
```

## Returns
The fitting data stored in the UI data item.